Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL036.atdf
         <register caption="" name="AD1CON5" offset="0x160" rw="RW" size="4">
            <bitfield caption="Compare mode bits" mask="0x00000003" name="CM" values="AD1CON5__CM" />
            <bitfield caption="" mask="0x0000000C" name="WM" />
            <bitfield caption="" mask="0x00000300" name="ASINT" />
            <bitfield caption="" mask="0x00001000" name="BGREQ" />
            <bitfield caption="" mask="0x00004000" name="LPEN" />
            <bitfield caption="" mask="0x00008000" name="ASEN" />
         </register>
         <register caption="" name="AD1CHIT" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CHH0" />
            <bitfield caption="" mask="0x00000002" name="CHH1" />
            <bitfield caption="" mask="0x00000004" name="CHH2" />
            <bitfield caption="" mask="0x00000008" name="CHH3" />
            <bitfield caption="" mask="0x00000010" name="CHH4" />
            <bitfield caption="" mask="0x00000020" name="CHH5" />
            <bitfield caption="" mask="0x00000040" name="CHH6" />
            <bitfield caption="" mask="0x00000080" name="CHH7" />
            <bitfield caption="" mask="0x00000100" name="CHH8" />
            <bitfield caption="" mask="0x00000200" name="CHH9" />
            <bitfield caption="" mask="0x00000400" name="CHH10" />
            <bitfield caption="" mask="0x00000800" name="CHH11" />
            <bitfield caption="" mask="0x00001000" name="CHH12" />
            <bitfield caption="" mask="0x00002000" name="CHH13" />
         </register>
      </register-group>
      <value-group caption="Analog-to-Digital Conversion Status bit" name="AD1CON1__DONE">
         <value caption="Analog-to-digital conversion is done" name="" value="0x1" />
         <value caption="Analog-to-digital conversion is not done or has not started" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Sample Enable bit" name="AD1CON1__SAMP">
         <value caption="The ADC sample and hold amplifier is sampling" name="" value="0x1" />
         <value caption="The ADC sample/hold amplifier is holding" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Sample Auto-Start bit" name="AD1CON1__ASAM">
         <value caption="Sampling begins immediately after last conversion completes; SAMP bit is automatically set." name="" value="0x1" />
         <value caption="Sampling begins when SAMP bit is set" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Operation Mode" name="AD1CON1__MODE12">
         <value caption="12-bit ADC operation" name="" value="0x1" />
         <value caption="10-bit ADC operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Conversion Trigger Source Select bits" name="AD1CON1__SSRC">
         <value caption="CLC2 module event ends sampling and starts conversion" name="" value="0xc" />
         <value caption="CLC1 module event ends sampling and starts conversion" name="" value="0xb" />
         <value caption="SCCP3 module event ends sampling and starts conversion" name="" value="0xa" />
         <value caption="SCCP2 module event ends sampling and starts conversion" name="" value="0x9" />
         <value caption="MCCP1 module event ends sampling and starts conversion" name="" value="0x8" />
         <value caption="Internal counter ends sampling and starts conversion (auto convert)" name="" value="0x7" />
         <value caption="Timer1 period match ends sampling and starts conversion (can trigger during Sleep mode)" name="" value="0x6" />
         <value caption="Timer1 period match ends sampling and starts conversion (will not trigger during Sleep mode)" name="" value="0x5" />
         <value caption="Active transition on INT0 pin ends sampling and starts conversion" name="" value="0x1" />
         <value caption="Clearing SAMP bit ends sampling and starts conversion" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Output Format bits" name="AD1CON1__FORM">
         <value caption="Signed Fractional 16-bit" name="" value="0x3" />
         <value caption="Fractional 16-bit" name="" value="0x2" />
         <value caption="Signed Integer 16-bit" name="" value="0x1" />
         <value caption="Integer 16-bit" name="" value="0x0" />
         <value caption="Signed Fractional 32-bit" name="" value="0x7" />
         <value caption="Fractional 32-bit" name="" value="0x6" />
         <value caption="Signed Integer 32-bit" name="" value="0x5" />
         <value caption="Integer 32-bit" name="" value="0x4" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="AD1CON1__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Operating Mode bit" name="AD1CON1__ON">
         <value caption="ADC module is operating" name="" value="0x1" />
         <value caption="ADC module is not operating" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC Result Buffer Mode Select bit" name="AD1CON2__BUFM">
         <value caption="Buffer configured as two 8-word buffers ADC1BUF7-ADC1BUF0 / ADC1BUF15-ADCBUF8" name="" value="0x1" />
         <value caption="Buffer configured as one 16-word buffer ADC1BUF15-ADC1BUF0" name="" value="0x0" />
      </value-group>
      <value-group caption="Sample/Convert Sequences Per Interrupt Selection bits" name="AD1CON2__SMPI">
         <value caption="Interrupts at the completion of conversion for each 16th sample/convert sequence" name="" value="0xf" />
         <value caption="Interrupts at the completion of conversion for each 15th sample/convert sequence" name="" value="0xe" />
         <value caption="Interrupts at the completion of conversion for each 14th sample/convert sequence" name="" value="0xd" />
         <value caption="Interrupts at the completion of conversion for each 13th sample/convert sequence" name="" value="0xc" />
         <value caption="Interrupts at the completion of conversion for each 12th sample/convert sequence" name="" value="0xb" />
         <value caption="Interrupts at the completion of conversion for each 11th sample/convert sequence" name="" value="0xa" />
         <value caption="Interrupts at the completion of conversion for each 10th sample/convert sequence" name="" value="0x9" />
         <value caption="Interrupts at the completion of conversion for each 9th sample/convert sequence" name="" value="0x8" />
         <value caption="Interrupts at the completion of conversion for each 8th sample/convert sequence" name="" value="0x7" />
         <value caption="Interrupts at the completion of conversion for each 7th sample/convert sequence" name="" value="0x6" />
         <value caption="Interrupts at the completion of conversion for each 6th sample/convert sequence" name="" value="0x5" />
         <value caption="Interrupts at the completion of conversion for each 5th sample/convert sequence" name="" value="0x4" />
         <value caption="Interrupts at the completion of conversion for each 4th sample/convert sequence" name="" value="0x3" />
         <value caption="Interrupts at the completion of conversion for each 3rd sample/convert sequence" name="" value="0x2" />
         <value caption="Interrupts at the completion of conversion for each 2nd sample/convert sequence" name="" value="0x1" />
         <value caption="Interrupts at the completion of conversion for each sample/convert sequence" name="" value="0x0" />
      </value-group>
