Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL036.atdf
         <register caption="" name="CCP1STAT" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP2STAT" offset="0x130" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP3STAT" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ICBNE" />
            <bitfield caption="" mask="0x00000002" name="ICOV" />
            <bitfield caption="" mask="0x00000004" name="ICDIS" />
            <bitfield caption="" mask="0x00000008" name="SCEVT" />
            <bitfield caption="" mask="0x00000010" name="ASEVT" />
            <bitfield caption="" mask="0x00000020" name="TRCLR" />
            <bitfield caption="" mask="0x00000040" name="TRSET" />
            <bitfield caption="" mask="0x00000080" name="CCPTRIG" />
            <bitfield caption="" mask="0x00000400" name="ICGARM" />
            <bitfield caption="" mask="0x00010000" name="RAWIP" />
            <bitfield caption="" mask="0x00020000" name="RBWIP" />
            <bitfield caption="" mask="0x00040000" name="TMRLWIP" />
            <bitfield caption="" mask="0x00080000" name="TMRHWIP" />
            <bitfield caption="" mask="0x00100000" name="PRLWIP" />
         </register>
         <register caption="" name="CCP1TMR" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP2TMR" offset="0x140" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP3TMR" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="TMRL" />
            <bitfield caption="" mask="0xFFFF0000" name="TMRH" />
         </register>
         <register caption="" name="CCP1PR" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP2PR" offset="0x150" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP3PR" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="PRL" />
            <bitfield caption="" mask="0xFFFF0000" name="PRH" />
         </register>
         <register caption="" name="CCP1RA" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP2RA" offset="0x160" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP3RA" offset="0x260" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPA" />
         </register>
         <register caption="" name="CCP1RB" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP2RB" offset="0x170" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP3RB" offset="0x270" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="CMPB" />
         </register>
         <register caption="" name="CCP1BUF" offset="0x80" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP2BUF" offset="0x180" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
         <register caption="" name="CCP3BUF" offset="0x280" rw="RW" size="4">
            <bitfield caption="" mask="0x0000FFFF" name="BUFL" />
            <bitfield caption="" mask="0xFFFF0000" name="BUFH" />
         </register>
      </register-group>
      <value-group caption="CCPx Time Base Clock Select" name="CCP1CON1__CLKSEL">
         <value caption="System Clock (Fsys)" name="" value="0x0" />
         <value caption="REFCLKO Output Clock" name="" value="0x1" />
         <value caption="Secondary Oscillator Clock (SOSC)" name="" value="0x2" />
         <value caption="CLC1 output" name="" value="0x3" />
		 <value caption="Reserved" name="" value="0x4" />
		 <value caption="Reserved" name="" value="0x5" />
		 <value caption="TCKIB Pin (remappable)" name="" value="0x6" />
		 <value caption="TCKIA Pin (remappable)" name="" value="0x7" />
      </value-group>
      <value-group caption="CCPx Time Base Prescale Select" name="CCP1CON1__TMRPS">
         <value caption="1:1 prescale" name="" value="0x0" />
         <value caption="1:4 prescale" name="" value="0x1" />
         <value caption="1:16 prescale" name="" value="0x2" />
         <value caption="1:64 prescale" name="" value="0x3" />
      </value-group>
      <value-group caption="CCPx Synchronization Source Select" name="CCP1CON1__SYNC">
         <value caption="No external synchronization" name="" value="0x0" />
         <value caption="This MCCP/SCCP" name="" value="0x1" />
         <value caption="MCCP1" name="" value="0x2" />
         <value caption="SCCP2" name="" value="0x3" />
		 <value caption="SCCP3" name="" value="0x4" />
		 <value caption="INT0 pin" name="" value="0x9" />
		 <value caption="INT1 pin" name="" value="0xA" />
		 <value caption="INT2 pin" name="" value="0xB" />
		 <value caption="INT3 pin" name="" value="0xC" />
		 <value caption="INT4 pin" name="" value="0xD" />
		 <value caption="CLC1" name="" value="0x10" />
		 <value caption="CLC2" name="" value="0x11" />
		 <value caption="Comparator 1" name="" value="0x18" />
		 <value caption="Comparator 2" name="" value="0x19" />
		 <value caption="Start of ADC conversion" name="" value="0x1B" />
		 <value caption="Free running mode and rolls over at FFFFh (Timer period ignored)" name="" value="0x1F" />
      </value-group>
      <value-group caption="CCPx Interrupt Output Postscale Select" name="CCP1CON1__OPS">
         <value caption="Each time base period match or input capture event" name="" value="0x0" />
         <value caption="Every 2nd time base period match or 2nd input capture event" name="" value="0x1" />
         <value caption="Every 3rd time base period match or 3rd input capture event" name="" value="0x2" />
         <value caption="Every 4th time base period match or 4th input capture event" name="" value="0x3" />
		 <value caption="Every 5th time base period match" name="" value="0x4" />
		 <value caption="Every 6th time base period match" name="" value="0x5" />
		 <value caption="Every 7th time base period match" name="" value="0x6" />
		 <value caption="Every 8th time base period match" name="" value="0x7" />
		 <value caption="Every 9th time base period match" name="" value="0x8" />
		 <value caption="Every 10th time base period match" name="" value="0x9" />
		 <value caption="Every 11th time base period match" name="" value="0xA" />
		 <value caption="Every 12th time base period match" name="" value="0xB" />
		 <value caption="Every 13th time base period match" name="" value="0xC" />
		 <value caption="Every 14th time base period match" name="" value="0xD" />
		 <value caption="Every 15th time base period match" name="" value="0xE" />
		 <value caption="Every 16th time base period match" name="" value="0xF" />
      </value-group>
      <value-group caption="CCPx Auto shutdown/Gating Source Enable" name="CCP1CON2__ASDG">
         <value caption="Disabled" name="" value="0x0" />
         <value caption="Comparator 1" name="" value="0x1" />
         <value caption="Comparator 2" name="" value="0x2" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="SCCP3 output" name="" value="0x8" />
		 <value caption="SCCP2 output" name="" value="0x10" />
		 <value caption="CLC1 output" name="" value="0x20" />
		 <value caption="OCFA pin (remappable)" name="" value="0x40" />
		 <value caption="OCFB pin (remappable)" name="" value="0x80" />
      </value-group>
