Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL036.atdf
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Internal Reference Voltage Stable Status bit" mask="0x00000200" name="IRVST" values="HLVDCON__IRVST" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="VDD trip point is between 2.00V and 2.22V" name="" value="0xe" />
         <value caption="VDD trip point is between 2.08V and 2.33V" name="" value="0xd" />
         <value caption="VDD trip point is between 2.15V and 2.44V" name="" value="0xc" />
         <value caption="VDD trip point is between 2.25V and 2.55V" name="" value="0xb" />
         <value caption="VDD trip point is between 2.35V and 2.69V" name="" value="0xa" />
         <value caption="VDD trip point is between 2.45V and 2.80V" name="" value="0x9" />
         <value caption="VDD trip point is between 2.65V and 2.98V" name="" value="0x8" />
         <value caption="VDD trip point is between 2.75V and 3.09V" name="" value="0x7" />
         <value caption="VDD trip point is between 2.95V and 3.30V" name="" value="0x6" />
         <value caption="VDD trip point is between 3.25V and 3.63V" name="" value="0x5" />
         <value caption="Reserved; do not use" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Reference Voltage Stable Status bit" name="HLVDCON__IRVST">
         <value caption="Indicates internal reference voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal reference voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
      <value-group caption="HLVD Module Enable bit" name="HLVDCON__ON">
         <value caption="HLVD module is enabled" name="" value="0x1" />
         <value caption="HLVD module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02610" name="INT" version="">
      <register-group name="INT">
         <register caption="Interrupt Control Register" name="INTCON" offset="0x8b90" rw="RW" size="4">
            <bitfield caption="External Interrupt 0 Edge" mask="0x00000001" name="INT0EP" values="INTCON__INT0EP" />
            <bitfield caption="External Interrupt 1 Edge" mask="0x00000002" name="INT1EP" values="INTCON__INT1EP" />
            <bitfield caption="External Interrupt 2 Edge" mask="0x00000004" name="INT2EP" values="INTCON__INT2EP" />
            <bitfield caption="External Interrupt 3 Edge" mask="0x00000008" name="INT3EP" values="INTCON__INT3EP" />
            <bitfield caption="External Interrupt 4 Edge" mask="0x00000010" name="INT4EP" values="INTCON__INT4EP" />
            <bitfield caption="Interrupt Proximity Timer Control bits" mask="0x00000700" name="TPC" values="INTCON__TPC" />
            <bitfield caption="Multi Vector Configuration bit" mask="0x00001000" name="MVEC" values="INTCON__MVEC" />
            <bitfield caption="" mask="0x007F0000" name="VS" />
         </register>
         <register caption="" name="PRISS" offset="0x8ba0" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="" mask="0x000000F0" name="PRI1SS" />
            <bitfield caption="" mask="0x00000F00" name="PRI2SS" />
            <bitfield caption="" mask="0x0000F000" name="PRI3SS" />
            <bitfield caption="" mask="0x000F0000" name="PRI4SS" />
            <bitfield caption="" mask="0x00F00000" name="PRI5SS" />
            <bitfield caption="" mask="0x0F000000" name="PRI6SS" />
            <bitfield caption="" mask="0xF0000000" name="PRI7SS" />
         </register>
         <register caption="" name="INTSTAT" offset="0x8bb0" rw="R" size="4">
            <bitfield caption="" mask="0x000000FF" name="SIRQ" />
            <bitfield caption="" mask="0x00000700" name="SRIPL" />
         </register>
