Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPL-0XX_DFP/1.3.57/atdf/PIC32MM0064GPL036.atdf
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff" />
         <value caption="2 SYSCLK cycle before a device Reset occurs" name="" value="0x2" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out in Sleep Mode Flag bit" name="RNMICON__WDTS">
         <value caption="WDT time-out has occurred during Sleep mode and caused a wake-up from sleep" name="" value="0x1" />
         <value caption="WDT time-out has not occurred during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1" />
         <value caption="An NMI will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Run Time Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTR">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="WDT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02050" name="RTCC" version="">
      <register-group name="RTCC">
         <register caption="" name="RTCCON1" offset="0x0" rw="RW" size="4">
            <bitfield caption="RTCC Signal Output Select bits" mask="0x00000070" name="OUTSEL" values="RTCCON1__OUTSEL" />
            <bitfield caption="RTCC Output Enable bit" mask="0x00000080" name="RTCOE" values="RTCCON1__RTCOE" />
            <bitfield caption="" mask="0x00000800" name="WRLOCK" />
            <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON1__ON" />
            <bitfield caption="Alarm Repeat Counter Value bits" mask="0x00FF0000" name="ALMRPT" />
            <bitfield caption="Alarm Mask Configuration bits" mask="0x0F000000" name="AMASK" values="RTCCON1__AMASK" />
            <bitfield caption="" mask="0x40000000" name="CHIME" />
            <bitfield caption="" mask="0x80000000" name="ALRMEN" />
         </register>
         <register caption="" name="RTCCON2" offset="0x10" rw="RW" size="4">
            <bitfield caption="RTCC Clock Select bits" mask="0x00000003" name="CLKSEL" values="RTCCON2__CLKSEL" />
            <bitfield caption="RTCC Prescaler" mask="0x00000030" name="PS" values="RTCCON2__PS" />
            <bitfield caption="" mask="0x0000F800" name="FDIV" />
            <bitfield caption="" mask="0xFFFF0000" name="DIV" />
         </register>
         <register caption="" name="RTCSTAT" offset="0x30" rw="R" size="4">
            <bitfield caption="" mask="0x00000001" name="HALFSEC" />
            <bitfield caption="" mask="0x00000002" name="ALMSYNC" />
            <bitfield caption="" mask="0x00000004" name="SYNC" />
            <bitfield caption="" mask="0x00000020" name="ALMEVT" />
         </register>
         <register caption="" name="RTCTIME" offset="0x40" rw="RW" size="4">
            <bitfield caption="" mask="0x00000F00" name="SECONE" />
            <bitfield caption="" mask="0x00007000" name="SECTEN" />
            <bitfield caption="" mask="0x000F0000" name="MINONE" />
            <bitfield caption="" mask="0x00700000" name="MINTEN" />
            <bitfield caption="" mask="0x0F000000" name="HRONE" />
            <bitfield caption="" mask="0x70000000" name="HRTEN" />
         </register>
         <register caption="" name="RTCDATE" offset="0x50" rw="RW" size="4">
            <bitfield caption="" mask="0x00000007" name="WDAY" />
            <bitfield caption="" mask="0x00000F00" name="DAYONE" />
            <bitfield caption="" mask="0x00003000" name="DAYTEN" />
            <bitfield caption="" mask="0x000F0000" name="MTHONE" />
            <bitfield caption="" mask="0x00100000" name="MTHTEN" />
            <bitfield caption="" mask="0x0F000000" name="YRONE" />
            <bitfield caption="" mask="0xF0000000" name="YRTEN" />
         </register>
         <register caption="" name="ALMTIME" offset="0x60" rw="RW" size="4">
            <bitfield caption="" mask="0x00000F00" name="SECONE" />
            <bitfield caption="" mask="0x00007000" name="SECTEN" />
            <bitfield caption="" mask="0x000F0000" name="MINONE" />
            <bitfield caption="" mask="0x00700000" name="MINTEN" />
            <bitfield caption="" mask="0x0F000000" name="HRONE" />
            <bitfield caption="" mask="0x70000000" name="HRTEN" />
         </register>
         <register caption="" name="ALMDATE" offset="0x70" rw="RW" size="4">
            <bitfield caption="" mask="0x00000007" name="WDAY" />
            <bitfield caption="" mask="0x00000F00" name="DAYONE" />
            <bitfield caption="" mask="0x00003000" name="DAYTEN" />
            <bitfield caption="" mask="0x000F0000" name="MTHONE" />
            <bitfield caption="" mask="0x00100000" name="MTHTEN" />
         </register>
      </register-group>
      <value-group caption="RTCC Signal Output Select bits" name="RTCCON1__OUTSEL">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="RTCC input clock source (based on the combination of the RTCCON2 bits, DIV[15:0] and PS[1:0])" name="" value="0x2" />
         <value caption="Seconds Clock is presented on the RTCC pin" name="" value="0x1" />
         <value caption="Alarm Pulse is presented on the RTCC pin when the alarm interrupt is triggered" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC Output Enable bit" name="RTCCON1__RTCOE">
         <value caption="RTCC clock output is enabled; signal selected by OUTSEL[2:0] is presented on the RTCC pin" name="" value="0x1" />
         <value caption="RTCC clock output is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="RTCC On bit" name="RTCCON1__ON">
         <value caption="RTCC module is enabled" name="" value="0x1" />
         <value caption="RTCC module is disabled" name="" value="0x0" />
      </value-group>
